<h1><center>Python Gap Analysis</center></h1>

![](https://media4.giphy.com/media/KAq5w47R9rmTuvWOWa/giphy.gif?cid=ecf05e47dwolwp7fomgnqo6ose5xlgbxwvap4gfzgnxhei13&rid=giphy.gif&ct=g)

# Python pandas 

### Question 1 
The Pandas DataFrame of the shown dataset is "df". Pandas is imported in your program as "pd".
![](https://imtcdn.azureedge.net/636631710140638418_374.png)

How do you obtain the count of males and females for different job roles as shown in the image below?

![](https://imtcdn.azureedge.net/636631710294964023_374.png)

In [16]:
import pandas as pd 
df = pd.DataFrame({'Name':['Juan K', 'Lucy Erlang','Quert', 'Kelly', 'David', 'Bulang'],
                 'Role': ['SDE','HR','Office','HR','SDE','SDE'],
                 'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Male']})

In [18]:
df.groupby(["Role","Gender"]).count()

               Name
Role   Gender
HR     Female     2
Office Male       1
SDE    Male       3

In [14]:
pd.crosstab(df["Role"], df["Gender"])

Gender  Female  Male
Role
HR           2     0
Office       0     1
SDE          0     3

### Question 2
Two DataFrames, df1 and df2, store the points table of teams from two different continents, respectively. How would you merge the two DataFrames into one final DataFrame (df_final), with each record having its unique index?

![](https://imtcdn.azureedge.net/636631711702636483_374.png)

In [30]:
df1 = pd.DataFrame({'Team': ['Billcoders', 'Fullquerty','SpoC'],
                   'Points': [2034,2311,2112],
                   'Gender': ['Male', 'Female', 'Male']})

In [31]:
df2 = pd.DataFrame({'Team': ['TeamCarlos', 'NYBats','IndianCharms'],
                   'Points': [2395,2234,2405],
                   'Gender': ['Female', 'Male', 'Male']})

In [32]:
df1

         Team  Points  Gender
0  Billcoders    2034    Male
1  Fullquerty    2311  Female
2        SpoC    2112    Male

In [33]:
df2

           Team  Points  Gender
0    TeamCarlos    2395  Female
1        NYBats    2234    Male
2  IndianCharms    2405    Male

In [47]:
pd.concat([df1, df2], ignore_index=True)

           Team  Points  Gender
0    Billcoders    2034    Male
1    Fullquerty    2311  Female
2          SpoC    2112    Male
3    TeamCarlos    2395  Female
4        NYBats    2234    Male
5  IndianCharms    2405    Male

### Question 3
You have to convert the given DataFrame ```df``` to a dictionary such that column A would be the key and column B would be the values corresponding to the keys. Which option would accomplish the desired task?

In [70]:
df = pd.DataFrame({'A': ['x','y','z'],
                 'B': [4,5,6]})

In [71]:
df

   A  B
0  x  4
1  y  5
2  z  6

In [94]:
df.to_dict()['B']

{0: 4, 1: 5, 2: 6}

In [91]:
df

   A  B
0  x  4
1  y  5
2  z  6

# This has to be the asnwer

In [92]:
df.set_index('A')['B'].to_dict()

{'x': 4, 'y': 5, 'z': 6}

In [ ]:
df.set_index('A').to_dict()

# Some EDA Questions

1. If there is a significant number of outliers, what is the best way to deal with them?
2. Which among the following choices should be kept in mind when creating visualization for exploration?
3. You explored the data and noticed that the distribution is skewed. What should you do?
4. Which of the following methods is not a simple outlier detection method for data exploration?